app/controllers/devise/sessions_controller.rb

SELECT "storages".* FROM "storages" WHERE "storages"."user_id" = $1  [["user_id", 1]]
---
  def new
    if current_user
      @files = Storage.where(user_id: current_user.id).all