app/controllers/admins_controller.rb

  def index

  	@user = User.all
---
SELECT "users".* FROM "users"