app/controllers/storages_controller.rb

SELECT "storages".* FROM "storages" WHERE "storages"."user_id" = $1  [["user_id", 1]]
---
	def index
    	@files = Storage.where(user_id: current_user.id).all

INSERT INTO "storages" ("name", "attachment", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "klcc"], ["attachment", "Screen_Shot_2017-11-10_at_5.07.53_PM.png"], ["created_at", "2017-11-13 12:47:58.412746"], ["updated_at", "2017-11-13 12:47:58.412746"]]
---
  	def create
  		@file = Storage.new(file_params)
  		if @file.save

SELECT  "storages".* FROM "storages" WHERE "storages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "storages" WHERE "storages"."id" = $1  [["id", 1]]
---
  	def destroy
	    @file = Storage.find(params[:id])
	    @file.destroy

SELECT  "storages".* FROM "storages" WHERE "storages"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
	  	def set_file
	      @file = Storage.find(params[:id])